{
	"items": [
	  {
		 "id": "6737582d23ff972cad801ba6",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-15T17:00:01.313Z",
		 "lastUpdated": "2024-11-15T17:00:01.313Z",
		 "createdOn": "2024-11-15T14:18:21.474Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">I’ve said a lot of words about the athletes in the National Hockey League in the past. Some of these opinions have been met with more backlash than others, but I believe my critics are simply afraid of the truths I speak. Here are my qualifications: I have been an out and proud bandwagon fan of the Colorado Avalanche since April of 2021–that is to say, the burgundy and blue runs in my blood. I am a dedicated BU hockey devotee, earning a free Men’s Under Armour Red Boston University Terriers Hockey Jersey (retail value $117.00) and over 20 singular tacos from El Jefe’s. I spent a brief stint on the NHL Youth Advisory Board, arguing with old men about pride jerseys and Fortnite skins. Also, I’m a lesbian, which automatically makes me more correct than everyone else.</p><p>‍</p><p id=\"\">With that established, here is a list of real, actual things I’ve said to my friends about professional male hockey players in the NHL.</p><p>‍</p><ol id=\"\"><li>Estrogen could’ve saved her.</li></ol><p>‍</p><p id=\"\">I know–it’s in the title of the article, but for good reason. Have you ever looked at a man? And I mean <em id=\"\">really</em> looked at him. Past all the greasy hair, the dirty skin, the general repulsiveness, and thought: <em id=\"\">Huh. He would make a GREAT girl</em>. I don’t expect all of you to understand me. In fact, a very small subsect of you will get it, but for the non-believers, I just ask that you walk with me here. First, hockey players are obsessed with their hair. The flow, the lettuce, whatever you want to call it. Just watch <a href=\"https://twitter.com/ForeverMightyFM/status/1364032214346956801\">this GIF</a> of former Anaheim Ducks players Max Jones and Maxime Comtois “recognizing the flow” of Trevor Zegras. Estrogen actually binds to receptors on hair follicles and boosts the growth phase, meaning players, once on estrogen, will find themselves with thicker, shinier, <em id=\"\">better</em> hair, instantly raising their social status and improving their aerodynamics on the ice. Second, the fat redistribution caused by estrogen could be <em id=\"\">advantageous</em> to players. <a href=\"https://youtu.be/GornRqDMS_g?si=0ryBna0foujVOnY8&t=123\" id=\"\">Checking</a>–using the body to knock an opponent in possession of the puck into the ice or against the boards–is an important part of defensive strategy. Increased body fat in the chest, hips, and thighs could lower players’ center of gravity and help them bounce off of the boards and others, enabling quicker recovery and better offense.</p><p>‍</p><ol start=\"2\" id=\"\"><li>They NEED to fuck.</li></ol><p>‍</p><p id=\"\">I mean, come on. Anyone with eyes could see this. Players constantly rough each other up, get up into each other’s faces, slam each other into the boards–hell, they even drop their thick, protective gloves to fight each other. Why would you risk bloody, split knuckles, knocked-out teeth, black eyes, broken noses, just for a brief moment of reprieve? I’ll tell you why: skin-to-skin contact is necessary to alleviate the thick, palpable sexual tension that builds throughout every single game. The rough, physical nature of men’s hockey, the aggressive posturing that occurs after every whistle, are all simply proxies for the heat of raw <em id=\"\">want</em>. You’ll never see a player skating to the penalty box after an altercation with anything but a feral smile on his face, the ecstasy of adrenaline fresh in his veins. Writing about the intersection of violence with physical desire, Richard Siken once said, “Sorry about the blood in your mouth. I wish it was mine.” What else is there to say?</p><p>‍</p><ol start=\"3\" id=\"\"><li>A BDSM relationship would fix him.</li></ol><p>‍</p><p id=\"\">To the uninitiated, this may seem absurd. However, hockey players are notorious for being superstitious and ritualistic to the point of absurdity. Waking up at the exact same time on game days, eating the same meals, napping for the same timespan, putting gear on in a specific order, tapping doorways in the arena a certain amount of times, the list goes on. Sidney Crosby, one of the best hockey players of all time, has been wearing the exact same jockstrap every single game since 2005. These athletes desperately claw for ways to feel in control of their game, and what better way than to remove control entirely? That way, players don’t need to spend countless hours worrying about routines and superstitions–they can devote all their focus to playing the best they can. Also, these guys LOVE constructing intricate rituals:</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/673757dcf42ce92f0c76e586_AD_4nXe0lNI0VE1VNSO0l5Jv8DUnrpM0bDtf3kpJEF3bVHLX6xIL5ntI6yzC7QJ9VDKizYAzwtUoET54fX7SWjTe0aevTJgZc0YaiD9YzyT9Xa2FmaXpop5Rpc9zsgpXRZ3BzrHrPYPOcg.png\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><p id=\"\">And these rituals? Oft-painful, definitely weird, with no clear, measurable benefit. Some examples: Andre Burakovsky’s gameday superstition of Alexander Ovechkin biting him, <a href=\"https://x.com/rmnb/status/1060279122541404160/photo/1\" id=\"\"><em id=\"\">hard</em></a>. Okay, painslut! TJ Oshie and Tom Wilson hitting each other’s asses with their sticks so brutally during warmups that Oshie’s stick <a href=\"https://twitter.com/Capitals/status/1206725939159285760?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1206725939159285760%7Ctwgr%5E91766d2521ecb80af5c53ae7823a983aa1ade847%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Frussianmachineneverbreaks.com%2F2019%2F12%2F16%2Ftj-oshie-broke-his-stick-hitting-tom-wilsons-ass%2F\" id=\"\"><em id=\"\">breaks</em></a>. Get them some whips and chains, stat! And last, but certainly not least, Pekka Rinne putting an actual, literal DOG COLLAR on Juuse Saros to congratulate him for a game well played (<a href=\"https://twitter.com/PredsNHL/status/1110393615426244608?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1110393615426244608%7Ctwgr%5E98f0314715b06dbbc0355f20860b234ea10674b0%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.ontheforecheck.com%2Ffive-hole-friday-ferda-nashville-predators%2F\" id=\"\">0:54–0:59</a>). Dear God, the narratives write themselves–this isn’t kinky subtext, it’s just text. Long live the freaks of the NHL, and may they be an inspiration for generations to come.</p><p id=\"\">To those who see my vision, you know where to find me. And to all of you who are fuming right now that a random dyke is making a mockery of the sport you so adore, I simply leave you with Galatians 4:16: “Am I therefore become your enemy, because I tell you the truth?”</p><p>‍</p>",
			"postsummary": "Have you ever looked at a man? And I mean really looked at him. Past all the greasy hair, the dirty skin, the general repulsiveness, and thought: Huh. He would make a GREAT girl.",
			"name": "\"Estrogen Could've Saved Her\" and Other Things I've Said to My Friends About Professional Hockey Players",
			"slug": "estrogen-couldve-saved-her-and-other-things-ive-said-to-my-friends-about-professional-hockey-players",
			"website-image": {
			  "fileId": "67375824120294079a507b48",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/67375824120294079a507b48_download-2.jpeg",
			  "alt": null
			},
			"author": "65d7840e3b62b64863ddfd5a"
		 }
	  },
	  {
		 "id": "67362faae0c04889c12b8af7",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-14T17:15:01.338Z",
		 "lastUpdated": "2024-11-14T17:15:01.338Z",
		 "createdOn": "2024-11-14T17:13:14.238Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": true,
			"article-text": "[PRE- PUNISH RELEASE]</p><p id=\"\">Ethel Cain has announced her new project, Perverts, is set to drop in January with its first single titled “Punish” coming out November 1st! I am quite excited, having been a stan since WAY before they disgraced Ethel’s memory by including Strangers in the It Ends With Us trailer. I refuse to watch that horrific film not only because it’s written by that wretched woman Colleen Hoover, but they ALSO tarnished the song where Ethel’s ghost sings about getting murdered and cannibalized by a man she thought loved her!! What the fuck!!! I’d rather be murdered and cannibalized than read a Colleen Hoover book and they went and disrespected Strangers like that. Anyway, I need to calm down. I can’t wait for Punish to drop! Surely its lyrics won’t worm their way into my brain, soul, and ever-beating heart! Surely it won’t lead me to reflect on my relationship with the world, the people in it, and being raised Catholic!&nbsp;</p><p>‍</p><p id=\"\">[POST- PUNISH RELEASE]</p><p id=\"\">I AM PUNISHED BY LOVE. This song has been out for less than two weeks now and I fear it has already made it into my top streamed songs of the year because I’ve looped it Hella. I want to fuck the guitar distortion, caress the lyrics, and french kiss the piano. There’s no fuck marry kill around here. I couldn’t kill anything. I just need to lick the sound of the swingset in the intro and dry hump the ambient background. Ethel has the voice of an angel – one I’d build cathedrals and write hymns for.&nbsp;&nbsp;</p><p>‍</p><p id=\"\">The tracklist dropped with song runtimes yesterday, and it is the shortest song on the album at six minutes and forty seconds with the longest song being over FIFTEEN MINUTES LONG!!! Golly, I’m going to perv out so hard when this drops! I respect her devotion to getting rid of the “fans” who can’t take her music seriously that she discussed on tumblr (which I fully agree with when your art covers subject matter as dark as hers) because I fear a lot of them won’t have the attention spans for this album. But me? Not I, says the dog.&nbsp;</p><p>‍</p><p id=\"\">I have made the pilgrimage to the front row at her concert, and I have been baptized with the touch of her hand on mine. I have had the bridge of Thoroughfare (favorite part of my favorite song) sung to me with direct eye contact and there’s no going back. Lock me up at this point. I’m about to get perverted in a way that has never been seen before.&nbsp;</p><p>‍</p>",
			"postsummary": "I have had the bridge of Thoroughfare (favorite part of my favorite song) sung to me with direct eye contact and there’s no going back. Lock me up at this point. I’m about to get perverted in a way that has never been seen before. ",
			"name": "PROUD PERVERT: Ethel Cain’s New Project Has Me Humping for Joy!",
			"slug": "proud-pervert-ethel-cains-new-project-has-me-humping-for-joy",
			"website-image": {
			  "fileId": "67362f9e1271d841d0ca6862",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/67362f9e1271d841d0ca6862_Proud%20Pervert.jpg",
			  "alt": null
			},
			"author": "65c100d180d80aa4901fb0ef"
		 }
	  },
	  {
		 "id": "6734c7551ee7e6309f157d75",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-13T17:00:02.254Z",
		 "lastUpdated": "2024-11-13T17:00:02.254Z",
		 "createdOn": "2024-11-13T15:35:49.866Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": true,
			"article-text": "CLAFLIN GENDIE NEUTCH- We’ve all been there, we needed a break from the incredibly boring 75 minute lecture to hit our local gender neutral bathroom and hit our elf bars. Just me? Oh ok.</p><p id=\"\">Anyways let me paint the picture: The 12th hamburger I’ve had this week (thank you Warren Dining) finally makes its way through my digestive tract faster than I could spell the word “laxative”. I’m secretly glad because I’ve been feigning for a sweet rip of my strawberry kiwi vape the entire time my professor ranted about his recent divorce (she got his beloved Clairo vinyls in the settlement).</p><p id=\"\">After watching 3 perfectly made edits of Demi Moore in <em id=\"\">The Substance</em>, I got up, washed my hands, and opened the door to find a blue haired alt baddie with not one, not two, but 5 eyebrow piercings!</p><p id=\"\"><em id=\"\">“Oh great, there goes all my woke points I got from voting for Kamala”</em> I thought to myself as I awkwardly shuffled away. Little did that enby know that the gendie neutch was going to reek of human excrement and stale vape juice.</p><p id=\"\">Of course I feel bad. Who wouldn’t? My accidental act of homophobia would give me horrible rep in my “Fem Tops for Harris” club (which has been real quiet in lieu of recent events). So I’ve decided to come out and expose myself before my peers find out: I like using the gender neutral bathroom even if I’m taking up the space intended for the non-binary.</p><p id=\"\">Sue me! I don’t care if I’m pissing off both “They” and “Them”. I’m an ally of the non-binary community, I literally follow the Wonderland System on Tiktok.</p><p>‍</p>",
			"postsummary": "CLAFLIN GENDIE NEUTCH- We’ve all been there, we needed a break from the incredibly boring 75 minute lecture to hit our local gender neutral bathroom and hit our elf bars. Just me? Oh ok.",
			"name": "I Finished Pooping in the Gender Neutral Bathroom and Walked Out to an Actual Non Binary Person Waiting To Use the Potty. ",
			"author": "6727ad7a5215eb780b921b15",
			"slug": "i-finished-pooping-in-the-gender-neutral-bathroom-and-walked-out-to-an-actual-non-binary-person-waiting-to-use-the-potty",
			"website-image": {
			  "fileId": "6734d6f317353de89ea68346",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/6734d6f317353de89ea68346_I%20Finished%20Pooping%20in%20the%20Gender%20Neutral%20Bathroom.jpg",
			  "alt": null
			}
		 }
	  },
	  {
		 "id": "67323e7a521e55ff404433a9",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-11T23:00:01.818Z",
		 "lastUpdated": "2024-11-11T23:00:01.818Z",
		 "createdOn": "2024-11-11T17:27:22.953Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": true,
			"article-text": "<p id=\"\"><strong id=\"\">Disappearing Fenway Busses and Malaysia Airlines Flight 370, It All Connects</strong></p><p id=\"\">Piper Hope</p><p>‍</p><p id=\"\">\tThere are many great mysteries in this world, and as a person who’s been to the International Museum of Cryptozoology in Maine, I know a lot about them. UFO sightings and bigfoot are all good and creepy to hear about but recently I’ve been experiencing a supernatural mystery myself. Everytime I wait at a BU bus (Boob Bus) station I have to wait for the bus that will take me back to my home, the beautiful oasis that is the Fenway campus. I knew that living there would mean that I would have to start getting my steps in, but I was always promised the reprieve of the “Fenway Bus” in times of need.&nbsp;</p><p id=\"\">According to the BU transit app the Fenway bus runs regularly, but according to my eyeballs the bus is only spotted once in a blue moon. No matter what stop I wait at, it’s always the same, I open mouth stare at the wait time until it says NOW and then I look up and there is no bus to be seen. Sometimes I swear I can smell the faint scent of B.O. that’s been absorbed into the bowling alley ass fabric that lines the Boob Bus seats, but no matter how hard I stare at either sides of the street no bus appears.&nbsp;</p><p id=\"\">The trouble then becomes that the next bus scheduled is somehow always scheduled for 7:36am the next morning. All of the Fenway busses seem to have disappeared out of thin air, EXCEPT when I’m walking down Beacon street. It’s always as soon as I exit Shippy’s (I’m there to buy buzzballs, to drink away the pain the Fenway Bus causes me) that I see the Fenway bus whiz past me filled to the brink with maximum two people. Where did you come from, where did you go?&nbsp;</p><p id=\"\">This is a case that doesn’t sit right with me. When Malaysian flight 370 disappeared in 2014 it inspired the most expensive search for a missing aircraft, so Boston University, where is the search for the missing Fenway busses?</p><p>‍</p>",
			"postsummary": "When Malaysian flight 370 disappeared in 2014 it inspired the most expensive search for a missing aircraft, so Boston University, where is the search for the missing Fenway busses?‍",
			"name": "Disappearing Fenway Busses and Malaysia Airlines Flight 370, It All Connects",
			"slug": "disappearing-fenway-busses-and-malaysia-airlines-flight-370-it-all-connects-2",
			"website-image": {
			  "fileId": "67323e53bd5a0178d6ea4948",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/67323e53bd5a0178d6ea4948_Disappearing%20Fenway%20Buses%20WEB.jpg",
			  "alt": null
			},
			"author": "65c10101dda4ee880f497199"
		 }
	  },
	  {
		 "id": "673238298c6c604113c18721",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-12T16:04:32.130Z",
		 "lastUpdated": "2024-11-12T16:04:32.130Z",
		 "createdOn": "2024-11-11T17:00:25.002Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">There are many mixed emotions as I go into my last semester of undergrad this Spring. I think about all I’ve accomplished, all the friends I’ve made, and all the challenges I’ve faced. And of course, it also makes me think about my post-college plans. Right now, it’s been 100% graduate school. But there are always other options. </p><p id=\"\">According to tiktok.gov, I heard topless maids make a lot of money, so I tried to practice a few weeks ago without an audience. Just my free labor. I was inspired by the women I saw on tiktok giving a rundown of their day in the life as topless maids and explaining how much money these lonely men give them. </p><p id=\"\">Our apartment bathroom needed some cleaning, and if I was gonna get down and dirty, it obviously made the most sense to do it with my clothes off. The main reason I found myself topless and cleaning my bathroom was to avoid getting my clothes dirty and then having to do more laundry. Tits out saves on the water bill. So not only am I cleaning the apartment, I am reversing climate change. I have three roommates and unfortunately for them, they did not get to witness. I understand the hard work it takes to clean topless let alone with an audience. </p><p id=\"\">And off I went. I scrubbed that countertop, getting in all the right spots and making sure that sink would spray and drain when I finished. I was on my knees until they were bruised, &nbsp;scrubbing our dirty grimy floor. And you bet at some points I was on all fours. I disinfected the toilet so people (me) can recreate their favorite chair dance when they’re taking their coffee shits. </p><p id=\"\">And voila, our bathroom was brand-assclapping-new. Topless maids really show how people with knockers can do anything, but they do it even better with their nips almost touching the toilet bowl. So if anyone wants a scrub mommy in their life, I say pitch the idea to them and let them know how eroti- empowering it would be. </p>",
			"postsummary": "Our apartment bathroom needed some cleaning, and if I was gonna get down and dirty, it obviously made the most sense to do it with my clothes off.",
			"name": "Scrub mommy: Cleaning My Apartment Bathroom Topless",
			"slug": "scrub-mommy-cleaning-my-apartment-bathroom-topless",
			"website-image": {
			  "fileId": "6732381954b343c23279576e",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/6732381954b343c23279576e_Scrub%20Mommy.jpg",
			  "alt": null
			},
			"author": "65d7840e3b62b64863ddfd5a"
		 }
	  },
	  {
		 "id": "6730ed108f9a2dbffa0e36f2",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-11T01:19:15.807Z",
		 "lastUpdated": "2024-11-11T01:07:35.097Z",
		 "createdOn": "2024-11-10T17:27:44.250Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\"><strong id=\"\">I’ve had enough of queer visibility: a letter to the bitch who won’t stop jangling their carabiner in silent study spaces</strong></p><p id=\"\">Maya Bride</p><p id=\"\">Like damn. We get it already!!!</p><p id=\"\">A lesbian without a carabiner is like an angel without wings yadda yadda. Dawg WHAT. If you can’t for <em id=\"\">one single second</em> put away the carabiner then I don’t even know what to say. A carabiner is LITERALLY built for easy access. Like…you <em id=\"\">can</em> take it off...go ahead. Give it a break, it actually won’t kill you. Truly nothing in this world is worse than sitting down in a <em id=\"\">silent</em> study space, finally ready to lock in without interruption, when you hear it: quietly at first, in the distance, then quickly nearing at superhuman speeds. A carabiner-wearing individual has entered your previously safe space and from this moment on you will <em id=\"\">never</em> know silence. Good luck getting anything done now. If this sounds like you (yes, you. i’m looking at <em id=\"\">you</em>. you know who you are) then listen close. You are quite possibly the most horrendously annoying person to grace God’s beautiful green Earth. It’s actually your fault I’m failing all my classes! I can’t get a single moment of peace on or off of this godforsaken campus because I’m being plagued! Constantly. Audibly. Assaulted. By that fucking jangle. Contrary to popular belief I actually don’t ! need to know where every gay person within a ten mile radius is but unfortunately that information is forcibly imposed upon my unsuspecting eardrums at every turn. At night when I lay my little head down on my pillow, I close my eyes, ready to be gently serenaded to sleep by the BU marching band outside my open window until I am suddenly <em id=\"\">violently</em> jolted back to consciousness by the grating song of the carabiner. Is it real? A figment of my imagination as a result of the constant onslaught? I really couldn’t tell you but what I do know is this: The Violence. Must. Stop. Here’s what I need you to do. Take a break. Take a breath. Look deep inside. And consider this: why? What could <em id=\"\">possibly</em> be prompting this sort of behavior? What sort of inadequacy are you trying to overcompensate for with your need to constantly make your presence known? All eyes should in fact NOT be on you in the center of the ring just like a circus. Maybe your parents didn’t pay enough attention to you but that doesn’t mean <em id=\"\">I</em> should have to :/ So please, for the love of god, I am on my knees humbly begging you with every fragment of my being to put the carabiner away and bestow the invaluable gift of silence upon those around you. Thank you and good night.</p><p>‍</p>",
			"postsummary": "A lesbian without a carabiner is like an angel without wings yadda yadda.",
			"name": "I've Had Enough of Queer Visability- A letter to The Bitch Who Won't Stop Jangling Their Carabiner in Silent Study Spaces",
			"slug": "ive-had-enough-of-queer-visability--a-letter-to-the-bitch-who-wont-stop-jangling-their-carabiner-in-silent-study-spaces-2",
			"author": "672da98bb64aa3fa6f931cba",
			"website-image": {
			  "fileId": "672e60b543127ac1fc1839b3",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672e60b543127ac1fc1839b3_Ive%20Had.jpg",
			  "alt": null
			}
		 }
	  },
	  {
		 "id": "6730db08f1bf7f0a5298b611",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-10T18:41:09.484Z",
		 "lastUpdated": "2024-11-10T17:15:01.163Z",
		 "createdOn": "2024-11-10T16:10:48.560Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">Sometimes, it’s just not worth expending the energy to tell that one person in your sociology class that if brains were currency, they’d be a broke ass bitch.&nbsp; Here’s a list of little white lies you can tell them instead:</p><p>‍</p><p id=\"\">1. “That’s such a valid point!”</p><p>‍</p><p id=\"\">Say this when they say that maybe Karl Marx only hated capitalism so much because he couldn’t afford a haircut.</p><p>‍</p><p id=\"\">2. “We’ve all made that mistake!”</p><p>‍</p><p id=\"\">Say this when they’re brutally humbled by the professor after confidently recounting their visit to the Panopticon on their family vacation to Greece last summer.</p><p>‍</p><p id=\"\">3. “That’s certainly something to think about!”</p><p>‍</p><p id=\"\">Say this when they say that poor people are just naturally more likely to be criminals because rich people don’t need things, and therefore they wouldn't steal things.&nbsp; Follow up by agreeing that a rich person has literally never stolen anything, ever, in the history of people or money or things.</p><p>‍</p><p id=\"\">4. “Thank you for your input!”</p><p>‍</p><p id=\"\">Say this when they say that they don’t know much about counterculture, but that they prefer real marble to linoleum.</p><p>‍</p><p id=\"\">5. “Of course, that’s fine!”</p><p>‍</p><p id=\"\">Say this when they take out a full course meal and start loudly munching next to you for the entire lecture.&nbsp; Don’t allow your rising blood pressure to spur you into slapping the footlong sammy with extra onions right out of their dipshit face.&nbsp; Instead, search inside yourself for compassion and try to remember: it’s not their fault they’re such a dipshit.</p><p>‍</p><p id=\"\">6. “That makes so much sense!&nbsp; I have absolutely no follow up questions.”</p><p>‍</p><p id=\"\">Say this when they say that we shouldn’t allow people under 5’8” to run for public office because short people are naturally more likely to commit war atrocities.</p><p>‍</p><p id=\"\">7. “I’d love to be partners!”</p><p>‍</p><p id=\"\">Say this when you find yourself suddenly roped into the hell of professor-assigned group projects.&nbsp; Immediately begin the process of microdosing them with dirty tissues collected from various infirm students around campus to infect them with every possible illness by the time presentation day rolls around.</p><p id=\"\">8. “I think you’d be a great social worker!”</p><p>‍</p><p id=\"\">Say this when they’ve just divulged their career plans and you can feel your faith in the human race slowly slipping through your grasp like a sad, wet clump of disintegrating gray matter.&nbsp; Begin mapping out your plans to befriend them and divert their major aspirations to an area in which they are undoubtedly better suited: perhaps Questrom?</p><p>‍</p>",
			"postsummary": "Some responses to save in your back pocket for those rainy days",
			"name": "“That’s Such A Valid Point” and Other Lies to Tell the Worst Person in Your Soc Class",
			"slug": "thats-such-a-valid-point-and-other-lies-to-tell-the-worst-person-in-your-soc-class",
			"website-image": {
			  "fileId": "6730dacd55afbe70803ea36c",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/6730dacd55afbe70803ea36c_(WEBSITE)%20%E2%80%9CThat%E2%80%99s%20Such%20A%20Valid%20Point%E2%80%9D%20and%20Other%20Lies%20to%20Tell%20the%20Worst%20Person%20in%20Your%20Soc%20Class.jpg",
			  "alt": null
			},
			"author": "65c101e0220a4806fb192a24"
		 }
	  },
	  {
		 "id": "672e66995e81b94bdf4726d8",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-10T18:41:09.484Z",
		 "lastUpdated": "2024-11-08T23:45:29.556Z",
		 "createdOn": "2024-11-08T19:29:29.812Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">The beginning of this love affair was oh so innocent. I had heard talk of you on campus,&nbsp; you have quite the reputation. However, it&nbsp; wasn’t until junior year that I let myself walk through your doors, having little idea of how my life would change forever.&nbsp;</p><p id=\"\">\t</p><p id=\"\">It was immediately clear why I had heard so much about you. I was instantly hooked on you as soon as I tasted you. And it’s so sweet how you’re there for everyone even in the dead of night. It’s just this one time I told myself. It’s not that serious, a one night stand you could say. I can’t fall for you like this.&nbsp;</p><p>‍</p><p id=\"\">But what was a one time thing soon turned into that one situationship you can’t keep yourself away from. Your scent tempts me every time I walk by you. I constantly crave you. Late at night, when the drinks are flowing, you’re all I can think about. I can’t keep myself away from you. We’ve shared many nights together. And no matter how hard I try not to, I’m always running back to you. I keep coming back for more of your girthy burritos. They fill me up so good I’m always stuffed. You put the hoe in frijoles. You really could do whatever you want to me. You’re the boss.&nbsp;</p><p>‍</p><p id=\"\">I was once a good girl, but I fear she is gone. You’re making me put the whore in whorechata. I can’t believe I ever once turned you down, not knowing what it was like to experience your glory. But now I can die happy, knowing that I’ve gotten to have you inside me.&nbsp;</p><p>‍</p>",
			"name": "You make me wanna put the whore in whorechata: A love letter to el jefe’s",
			"slug": "you-make-me-wanna-put-the-whore-in-whorechata-a-love-letter-to-el-jefes",
			"author": "65c100e4ebe159dbf241f695",
			"postsummary": "The things you do to me El Jefes ",
			"website-image": {
			  "fileId": "672e676a7e4422edbc5e8594",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672e676a7e4422edbc5e8594_You%20make%20me%20wanna%20put%20the%20whore%20in%20whorechata.jpg",
			  "alt": null
			}
		 }
	  },
	  {
		 "id": "672e63540d1fe98589a4778a",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-10T18:41:09.484Z",
		 "lastUpdated": "2024-11-08T19:30:01.262Z",
		 "createdOn": "2024-11-08T19:15:32.982Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">So there I am, relaxing in bed on a rare occasion where my roommate is back home for the weekend. Don’t get me wrong, my roommate is lovely and wonderful and we are friends, but her absence in our shared room at night leads to the presence of another—my lovely girlfriend.</p><p>‍</p><p id=\"\">We had been excitedly planning our sleepover for a full week, planning out all the fun activities we would get to do together, topics to gossip about, and even snacks and drinks prepped way in advance. (Maybe too far in advance…the Sprite was flat :/)</p><p>‍</p><p id=\"\">While laying in bed, we do what you would expect two lesbians in a relationship to be doing on a Sunday morning. We schedule our abortion appointments, lick the postage on a minimum of five mail-in ballots each, and change our pronouns in our Instagram bio. We are enjoying what any liberal would call a lovely morning.</p><p>‍</p><p id=\"\">When all of a sudden,&nbsp; I hear this agitating, grating voice…the fire alarm at full blast. Oh great. Another popcorn bag burnt to hell and back for the crime of being forgotten. Effectively ruining my perfect morning where I had scheduled performing transgender operations with my girlfriend (first side by side, and then on each other).</p><p>‍</p><p id=\"\">I angrily rush out of bed, grab my shoes and keys and such, and am thrust into the cold morning sunlight. Oh how I miss the lgbt rainbow cocoon of my dorm! Who is this evil spirit manipulating me into going outside and ruining my girlfriend sleepover instead of dyeing my hair blue???</p><p>‍</p><p id=\"\">I may never know the exact identity of whoever caused there to be so much smoke in the air at 610 Beacon that I was blinded, coughing and feeling my way to the exit, but I do know one thing for certain. The fire alarm was evil, it ruined my sleepover with my girlfriend, and there’s only one question now: how do I ever move forward after this?&nbsp;</p><p>‍</p>",
			"postsummary": "What is the worst thing that could happen to me right now? ",
			"name": "Evil Fire Alarm is Set Off at 610 Beacon During Sleepover with Girlfriend",
			"slug": "evil-fire-alarm-is-set-off-at-610-beacon-during-sleepover-with-girlfriend",
			"website-image": {
			  "fileId": "672e5f5050009531b672f9f6",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672e5f5050009531b672f9f6_EvilFireAlarm.jpg",
			  "alt": null
			}
		 }
	  },
	  {
		 "id": "672e60d4473a5001a611442f",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-10T18:41:09.484Z",
		 "lastUpdated": "2024-11-10T17:27:08.950Z",
		 "createdOn": "2024-11-08T19:04:52.542Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">Like damn. We get it already!!!</p><p id=\"\">A lesbian without a carabiner is like an angel without wings yadda yadda. Dawg WHAT. If you can’t for <em id=\"\">one single second</em> put away the carabiner then I don’t even know what to say. A carabiner is LITERALLY built for easy access. Like…you <em id=\"\">can</em> take it off...go ahead. Give it a break, it actually won’t kill you. Truly nothing in this world is worse than sitting down in a <em id=\"\">silent</em> study space, finally ready to lock in without interruption, when you hear it: quietly at first, in the distance, then quickly nearing at superhuman speeds. A carabiner-wearing individual has entered your previously safe space and from this moment on you will <em id=\"\">never</em> know silence. Good luck getting anything done now. If this sounds like you (yes, you. i’m looking at <em id=\"\">you</em>. you know who you are) then listen close. You are quite possibly the most horrendously annoying person to grace God’s beautiful green Earth. It’s actually your fault I’m failing all my classes! I can’t get a single moment of peace on or off of this godforsaken campus because I’m being plagued! Constantly. Audibly. Assaulted. By that fucking jangle. Contrary to popular belief I actually don’t ! need to know where every gay person within a ten mile radius is but unfortunately that information is forcibly imposed upon my unsuspecting eardrums at every turn. At night when I lay my little head down on my pillow, I close my eyes, ready to be gently serenaded to sleep by the BU marching band outside my open window until I am suddenly <em id=\"\">violently</em> jolted back to consciousness by the grating song of the carabiner. Is it real? A figment of my imagination as a result of the constant onslaught? I really couldn’t tell you but what I do know is this: The Violence. Must. Stop. Here’s what I need you to do. Take a break. Take a breath. Look deep inside. And consider this: why? What could <em id=\"\">possibly</em> be prompting this sort of behavior? What sort of inadequacy are you trying to overcompensate for with your need to constantly make your presence known? All eyes should in fact NOT be on you in the center of the ring just like a circus. Maybe your parents didn’t pay enough attention to you but that doesn’t mean <em id=\"\">I</em> should have to :/ So please, for the love of god, I am on my knees humbly begging you with every fragment of my being to put the carabiner away and bestow the invaluable gift of silence upon those around you. Thank you and good night.</p>",
			"name": "I've Had Enough of Queer Visability- A letter to The Bitch Who Won't Stop Jangling Their Carabiner in Silent Study Spaces",
			"slug": "ive-had-enough-of-queer-visability--a-letter-to-the-bitch-who-wont-stop-jangling-their-carabiner-in-silent-study-spaces",
			"website-image": {
			  "fileId": "672e60b543127ac1fc1839b3",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672e60b543127ac1fc1839b3_Ive%20Had.jpg",
			  "alt": null
			},
			"author": "672da98bb64aa3fa6f931cba",
			"postsummary": "A lesbian without a carabiner is like an angel without wings yadda yadda "
		 }
	  },
	  {
		 "id": "672d38d98dda78adc6b1d53d",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-07T23:00:02.263Z",
		 "lastUpdated": "2024-11-07T23:00:02.263Z",
		 "createdOn": "2024-11-07T22:02:01.656Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p>‍</p><p id=\"\">Fighting for your life, head to butthole, sweat dripping down your forehead. You squeeze and squeeze, almost giving yourself a hernia, it just can't come out.</p><p id=\"\">‍</p><p id=\"\">But then, a glimpse of hope. You can feel it coming, finally revealing itself. However, you hear the creaking of the communal bathroom door the familiar sound of the squeak of someone's shower shoes and you stop. Your poop slowly retreats in, surrendering to your own anxiety. All the progress you made is gone, all because of your crippling poop anxiety. Now you sit, suffering, regretting your warren dining dinner.</p><p id=\"\">‍</p><p id=\"\">But I say no more.</p><p id=\"\">‍</p><p id=\"\">I understand the fear, anxiety, the constant worrying about whether or not they can tell that you're pooping. What I want to say is me too. I’m here with you, and I understand. But what we need to say is Me Poo. We the people, to form a more perfect union of the floor, must come together and conquer our fears. We should not be mentally bound by our bowel movements. I declare the movement: Me Poo.</p><p id=\"\">‍</p><p id=\"\">Every man, woman, and non-binary person, deserves life, liberty, and the poop-suit of happiness. This means loudly, proudly pooping in the communal restrooms. If you need to shart, do it. If you need to grunt, do it. If you need to let out an eardrum-shattering scream, do it. It is our inalienable right to poop. And Me Poo wants to create an accepting, supportive space that allows everyone to actualize this right fully.&nbsp;</p><p id=\"\">‍</p><p id=\"\">We hold these truths to be self-evident, that all poops are created equal. That means we support and accept our brethren even if we are brushing our teeth while they are blowing up the toilet. As Benjamin Franklin once said, “there never was a good war, or a bad [poop]”.</p><p id=\"\">‍</p><p id=\"\">As our founding fathers support the right to poop freely, so should you. Join us in saying Me Poo, so that way We Poo.&nbsp;</p><p id=\"\">‍</p><p id=\"\">Your Obedient Servant,</p><p id=\"\">‍</p><p id=\"\">M. Gilby</p><p id=\"\">‍</p>",
			"postsummary": "#meepoo",
			"name": "Me Poo: A New Movement Empowering Young Women to Poop in the Communal Restrooms",
			"slug": "me-poo-a-new-movement-empowering-young-women-to-poop-in-the-communal-restrooms",
			"website-image": {
			  "fileId": "672d3843bd0634dcf81c0e0a",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672d3843bd0634dcf81c0e0a_Me%20Poo_%20Website%20Empowering%20Young%20Women%20to%20Poop%20in%20the%20Communal%20Restrooms.png",
			  "alt": null
			}
		 }
	  },
	  {
		 "id": "672a648612ce9db7089f9887",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-06T23:00:01.577Z",
		 "lastUpdated": "2024-11-06T23:00:01.577Z",
		 "createdOn": "2024-11-05T18:31:34.606Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\"><em id=\"\">After a completely inexplicable mixup occurred at 881 Commonwealth Ave, the affected student has been asked to give her statement on the artificial insemination situation for legal reasons. She wanted to tell her story in a tribute to the first and only BU baby.&nbsp;&nbsp;</em></p><p>‍</p><p id=\"\">Dear BU Baby,</p><p id=\"\">They said they would give me extra dining points to not sue so here we are. I didn’t want this to have to happen. To be honest, I didn’t even want a pap smear. But as luck would have it, my Patient Connect gave me a co-pay and brought me to you.</p><p id=\"\">Once I knew you were coming, my whore moans turned into hormones and I became a respectable soon-to-be milf. I enrolled in the PDP class “Giving Birth on the Charles River.” I knew I was gonna go with a natural water birth, and if I’m lucky, you’ll come out as a D1 Rowing athlete. I watched every episode of Jane the Virgin, but not only did it make me sad cause I’m bitchless, but I don’t even know who your father is! Could it be slutty daddy Troye Sivan? Or hottie mama Troye Sivan?&nbsp;</p><p id=\"\">Some club set up a gender reveal on COM Lawn, where the erect fountain was supposed to change the water color to pink or blue. My friend said I would make a good boy mom so that basically means I am an asshole. We actually still have no idea the results because no one has cleaned the water filters in years so it looks like you’re gonna be a baby Grinch.&nbsp;</p><p id=\"\">And your name? Well, I’ve been cooking. I wanted something that screamed resilience, beauty, and grace. Boston University will be welcoming Rhettleighy Beyoncé this fall.</p><p id=\"\">There are just a few days before your due date now, and I wanted to say that Mommy loves you no matter what (except if you come out with a tail, I’m killing myself). I have to go on unpaid maternity leave now, so that means I’m taking a gap semester but I am still paying tuition. Make it make sense.&nbsp;</p><p>‍</p><p id=\"\">Love, Mommy</p><p>‍</p>",
			"postsummary": "Went to Student Health services and got stuffed but at least Thanksgiving is around the corner. ",
			"name": "I Went to Student Health Services For a Pap Smear and Got Artifically Inseminated ",
			"slug": "i-went-to-student-health-services-for-a-pap-smear-and-got-artifically-inseminated",
			"website-image": {
			  "fileId": "672a64221e9b246bcea13881",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672a64221e9b246bcea13881_I%20Went%20to%20Student%20Health%20Services%20For%20a%20Pap%20Smear%20and%20Got%20Artificially%20Inseminated.jpg",
			  "alt": null
			},
			"author": "6727af53475177577ca0dee8"
		 }
	  },
	  {
		 "id": "672a62d1bf72ce4ab92f3981",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-06T17:00:02.307Z",
		 "lastUpdated": "2024-11-06T17:00:02.307Z",
		 "createdOn": "2024-11-05T18:24:17.148Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">Fun fact! My roomie and I have whiteboard nights in which I explain needless and unimportant things to her – such as the plot and love mess that is Miraculous Ladybug – and she sits and listens to me. Because we love each other.&nbsp;</p><p id=\"\">&nbsp;</p><p id=\"\">And do you know who else loves each other? The subject of our latest whiteboard night, Ben Affleck and Matt Damon! I spent hours showing her clips and building a timeline to show just how deep their 43-year relationship went. It was a long time, but a long time well spent (not as long as they’ve spent together).</p><p id=\"\">&nbsp;</p><p id=\"\">Yet as I was falling asleep after that whiteboard night, I was unable to allow slumber to overtake me – and it wasn’t because of my blood alcohol level this time. But why?</p><p id=\"\">&nbsp;</p><p id=\"\">Then it hit me! If my roommate was also clueless about them, then maybe not everyone is aware of the intense, extreme slight homoerotic relationship between the two lovers best friends. I needed to spread this knowledge to all those capable of thought and hearing.</p><p id=\"\">&nbsp;</p><p id=\"\">So without further ado, I present the points I made to my roommate on whiteboard night on the subject that has kept me on TikTok for hours looking at edits of two white men!<br><br></p><ul id=\"\"><li>They quite literally have a whole Wikipedia page called <a href=\"https://en.wikipedia.org/wiki/Ben_Affleck_and_Matt_Damon\" id=\"\">Ben Affleck and Matt Damon</a></li><li>Apart from sharing said Wiki article, they once shared a bank account with one another for years where they would pool all their money together.</li><li>Those damn matching puka necklaces</li><li>They wrote Good Will Hunting together. And when they won their JOINT Oscar together, they made their little men kiss (that is not a euphemism).</li><li>They were in talks to star in Brokeback Mountain together (this would’ve likely set a course for a different timeline for both men)</li><li>Matt would commute from Boston to LA when Ben had auditions because Ben was scared of flights</li><li>In an interview, Matt was posed the question “Who would you turn gay for?” And after a few jokes, he landed on the answer “go for the kid i would’ve turned gay for when I was 10” (Ben and him met when Matt was 10!)</li><li>In reference to a magazine photo: “You know what we like to call that in our community? Top, bottom” on Jimmy Kimmel</li><li>Matt straddling and hiding in Ben’s jacket on Jimmy Kimmel (as a bit, obviously)</li><li>When receiving a compliment, Matt says “If I’m good at anything it’s like, picking partners.” And when listening them off, names Ben BEFORE HIS WIFE</li><li>Matt’s face absolutely lighting up when Ben goes up to him at the Golden Globes and proceeds to cuddle him</li><li>On Ellen - “Name 3 places you’re likely to find Matt Damon” Ben: “The beach, the bar, and my bed</li><li>When holding up a shit that said Ben-Gay – “in the unlikely but wonderful event – hope, hope – that Matt finally comes around”</li><li>Matt visiting Ben’s house and proceeding to take off his wedding ring – it could mean nothing!</li><li>“I don’t want to be his friend in public… it’s way too important a friendship for that…not for public consumption in that way.” – This is literally just sweet.</li><li>Jennifer Gardiner (Ben’s first wife) calling Matt her “darling husband’s darling husband” and referring to him as half of one of the greatest love stories ever told – not with her, but with Matt Damon. “We’ve all been married to each other for 5 years.”</li><li>That fucking Dunkin’ commercial – “my partner” “you said you were going to support me “you remember when I said I’d do anything for you?”</li><li>Matt was positively ”jovial” hanging out with Ben after his separation from Jennifer Lopez</li></ul><p id=\"\">&nbsp;</p><p id=\"\">But yeah, maybe all these points are worthless and… could mean nothing. But I will say, Ben and J-Lo filed for their divorce on April 26th, AKA Challengers’ release day. The small coincidences of life.&nbsp;</p><p id=\"\"><em id=\"\">&nbsp;</em></p><p id=\"\"><em id=\"\">As a disclaimer, I don’t want anyone to take this as an offense and as if I’m trying to “out” anyone. It’s a joke. Chill</em></p><p>‍</p>",
			"name": "Giving My Roommate a White Board Explaination on Matt Damon and Ben Affleck ",
			"slug": "giving-my-roommate-a-white-board-explaination-on-matt-damon-and-ben-affleck",
			"website-image": {
			  "fileId": "672a62bb3cff455bd202b205",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672a62bb3cff455bd202b205_Matt%20Damon%20and%20Ben%20Affleck%20.jpg",
			  "alt": null
			},
			"author": "65c100c234bf72ebad0893d2"
		 }
	  },
	  {
		 "id": "672a6176c023bddc11d66b83",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-05T23:00:02.158Z",
		 "lastUpdated": "2024-11-05T23:00:02.158Z",
		 "createdOn": "2024-11-05T18:18:30.976Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">I like to run a tight ship in my Allston abode; just four girls, two floors, one fridge. But one of these things is not like the other. Because my house isn’t just an overpriced apartment, it's a lesbian frat house. That is with one major, glaring exception.&nbsp;</p><p>‍</p><p id=\"\">My one straight roommate lives on the very top floor. I respect that about her, you know, keeping that lifestyle away from the kids. She isn’t home very often either, which I also respect. Not sure what exactly <em id=\"\">those people</em> get up to though… I guess she’s very busy holding hands with men or loving Sabrina Carpenter or some shit? I don’t know. Either way I only ever see her in flashes; brief glimpses of how the other half lives.&nbsp;</p><p>‍</p><p id=\"\">What would she have said if she came home during our <em id=\"\">Heartstopper</em> watch party? Our <em id=\"\">But i'm a Cheerleader</em> movie night? Shit those were both this week that’s a little on the nose. But maybe she would have found their friendship really beautiful, just girls supporting each other! &lt;3. If only she had been home when we watched masterpiece, “What if Being Gay Was Normal and Straight Was a Minority,” ifyky. Do straight people even watch youtube short films?&nbsp;</p><p>‍</p><p id=\"\">The other night my normal (gay) roommate put up a billboard of Renee Rap in our living room. I don’t even like that cunt (my consensus; sexy but annoying) and yet it brought a sense of warmth to the space. Just the grace of a set of 4x4 foot tall gay-by blues staring down at me. But should we let my straight roommate hang her own decor? Who’s even a straight celebrity these days? Chet Hanks? Who’s the bachelor this season?&nbsp;&nbsp;</p><p>‍</p><p id=\"\">And what if she was there for our pre games? She once asked me if someone was “gay or just frumpy” at a party. Which, not gonna lie, stung, but, upon examination is a valid question. Cause why am I wearing a shirt 3 sizes too big to the frat? Do gay people have a goddamn scarcity mindset for clothing size? You can look dykey in a crop top. I promise it will be ok.&nbsp;</p><p>‍</p><p id=\"\">Perhaps I imagine that she’s more tapped into my culture than she really is. Because when I came home to find her making out with someone on the couch, It wasn’t a girl. He just needed a haircut. And maybe, that’s ok #straightally</p><p>‍</p>",
			"postsummary": "I live in a tight-knit house with four roommates in Allston - it's essentially a \"lesbian frat house\" with one exception. I have one straight roommate who keeps to herself on the top floor. I wonder how she would react to our group's LGBTQ-themed movie nights and decor choices that celebrate queer culture. Despite some initial awkwardness, I ultimately seem open to my straight roommate being an \"ally\" in her own way.",
			"name": "How The Other Half Lives: Conversations With My One Straight Roommate",
			"slug": "how-the-other-half-lives-conversations-with-my-one-straight-roommate-2",
			"website-image": {
			  "fileId": "672256385b91d9945b133ab1",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672256385b91d9945b133ab1_How%20The%20Other%20Half%20Lives%20Conversations%20With%20My%20One%20Straight%20Roommate.png",
			  "alt": null
			},
			"author": "6727ad03dbd8307facf4766f"
		 }
	  },
	  {
		 "id": "67290218cf9e71c3ad4414fb",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-12T17:00:01.823Z",
		 "lastUpdated": "2024-11-12T17:00:01.823Z",
		 "createdOn": "2024-11-04T17:19:20.750Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">There is an epidemic on this campus. And that epidemic is bisexual twinks. They are walking around this campus with slutty waists, cunty outfits, and an unmatched audacity. &nbsp;They’re manipulating men and women alike. Someone must take care of them or they will run the city of Boston. As a (pretty much) lesbian, this role often falls to me. A twink handler, one could say. However, as the semester moves forward I have become overworked, underpaid, and overbooked!</p><p id=\"\">This year Boston University gave me a brownstone room with a decent sized basement. While this may seem like simple luck, it was actually part of the stipend for my UROP project: locking as many bisexual twinks in that basement as damn near possible. Part research, part community aid I set up my new enclosure with all the necessary supplies: baggy pants (à la Troye Sivan), dangly earrings, a record player <em id=\"\">and</em> cassette player &nbsp;(Alex G, Hole, Omar Apollo, and Patti Smith queued on a loop), a thousand fidget toys, Hot Cheetos, and a singular Yerba Mate. I captured my subjects sunning around campus with a very very large net, scooping them up every time I saw a walk too sassy or a baby tee too perfectly cropped. </p><p id=\"\">Once safely in my basement enclosure, the bisexual twinks settled in quite comfortably, each finding a corner to brood in while eyeing the Yerba Mate and critiquing each other’s thrifting choices. I had even added a little ‘sulking station’ under a strategically placed patch of moody string lights (complete with all the oversized hoodies and blankets they’d need to feel safely enveloped) which quickly became the most popular corner. However, it wasn’t all smooth sailing. Almost immediately, they began organizing a rebellion, communicating in half-baked TikTok quotes and hushed whispers. I noticed that with each week, managing the twinks required more of my energy. Every day, I fielded demands for new fidget toys, warm light fixtures, and never ending American Spirits. They girl-bossed and they gaslite me into thinking perhaps I made a mistake – perhaps I could not create them a new home. </p><p id=\"\">But just when I thought the twinks had broken me down, a strange shift occurred. One of the more assertive twinks (the better of smudged eyeliner) stood up during a rebellion planning session and declared, “What if we just… like… <em id=\"\">thrive</em> in here?”</p><p id=\"\">The twink coalition found a new sense of purpose. They pooled their resources and divided up responsibilities with surprising efficiency. The artsier twinks became interior designers curating a vibrant living space that could rival any Brooklyn pop-up gallery. The philosophers and poets organized nightly ‘salons’ in the sulking station, where they took turns reading overly earnest zines and pondering the existential questions raised in both male manipulatory music and queer coded films. They even crafted a constitution, declaring the basement a sovereign nation known as Twinktopia.</p><p id=\"\">Twinktopia became a self-sustaining ecosystem. They even set up a barter system, where talents and resources were exchanged for hand-rolled cigarettes, vintage accessories, or homemade kombucha. Some started learning practical skills – little bi boys who had once never held a power drill suddenly began constructing loft beds and floating bookshelves from salvaged wood, carving an artisan paradise in the heart of the basement. As for me?</p><p id=\"\">No longer was I an overburdened twink wrangler; I have ascended (read: been promoted to) benevolent overseer, an ethereal monarch, a passive queer dictator. I realized they didn’t need containment, they needed a space to create glittering, grunge-worn utopia.</p><p id=\"\">‍</p>",
			"name": "Mutual Aid: Locking All BU Bisexual Twinks in my Bay State Basement",
			"slug": "mutualaidtwinks",
			"author": "65c102293e6c0adcd127468e",
			"postsummary": "There is an epidemic on this campus. And that epidemic is bisexual twinks. They are walking around this campus with slutty waists, cunty outfits, and an unmatched audacity. They’re manipulating men and women alike. Someone must take care of them or they will run the city of Boston.",
			"website-image": {
			  "fileId": "67337de07fe41b6175ac8245",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/67337de07fe41b6175ac8245_Baystate%20twinks_%20WEB.jpg",
			  "alt": null
			}
		 }
	  },
	  {
		 "id": "67241bad9abe42af573d8746",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-05T18:42:33.598Z",
		 "lastUpdated": "2024-11-04T17:30:01.470Z",
		 "createdOn": "2024-11-01T00:07:09.546Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">Trump said that the Haitians in Springfield Ohio are eating the dogs and eating the cats; but has he considered that I am actually eating cat? Yes, that’s right, I am eating political pussy. I have given a lot of consideration as to which politicians I want to devour the most: Hillary<em id=\"\"> Clit</em>on, she sounds like my grandma, Nancy Pelosi, too saggy; so who am I eating out?&nbsp;</p><p>‍</p><p id=\"\">I’ll tell you! Here’s my top 4:&nbsp;</p><p>‍</p><ol id=\"\"><li><em id=\"\">Obviously </em>Alexandria Ocasio-Cortez. For starters, HAVE YOU SEEN HER??? She is just beautiful, some may argue too pretty to be a politician. Seriously, when was the last time you saw a politician so scrumptious? She is also super accessible: she went to BU. I’m sure if I wander around long enough in the international relations department I’ll bump right into her. Fun fact: Did you know she lived in warren towers? I could be sleeping in the same bed she went to pound town on. God damn, I have a lady boner.&nbsp;</li><li>JD Vance. I know I know, he isn’t a biological female (to my knowledge). But I think his dick is so small it might as well be a clit. Therefore, I think it is fair to say that I could potentially eat him out. My whole life I have been attracted to male manipulators like Vance. Maybe it’s my daddy issues or something… regardless, I would let him tell me what to do since I so crave his useless validation. Have you seen the way he makes up stories? You know I love when men lie to me, that’s why I stayed with my ex so long.&nbsp;</li><li>Recently I have been looking for a more fit partner which is why I am turning towards Marjorie Taylor Greene. She is spunky, powerful, and most importantly unhinged. I will never know her next move and that is so very exciting in the bedroom. Speaking of her immense power, have you seen her workout routine? She lifts more than I weigh!!! She may just be the perfect dommy mommy for my oral escapades.&nbsp;</li><li>In light of the next campaign, I must highlight my personal vote, Kamala Harris. Her vibrant energy is contagious and draws me to her like a moth to a flame. Do you think she laughs when she cums? Do you think I will start laughing like her after we share this intimate experience? I hope so. Her signature laugh turns me on everytime I hear it. I can only imagine how powerful I would become if I could laugh like her. Not only would we have amazing physical chemistry, but our political ideas align, which is really important for a healthy sexual relationship.&nbsp;</li></ol><p>‍</p><p id=\"\">You heard it here first; these are my top 4 picks to eat out. Please don’t contact me about my crazed opinions, just take it to the polls.&nbsp;</p><p>‍</p>",
			"postsummary": "Trump said that the Haitians in Springfield Ohio are eating the dogs and eating the cats; but has he considered that I am actually eating cat?",
			"name": "They're Eating the Cats: 4 Female Politicians I Would Eat Out ",
			"slug": "theyre-eating-the-cats-4-female-politicians-i-would-eat-out",
			"website-image": {
			  "fileId": "6728ffd8a471c6a5c99480de",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/6728ffd8a471c6a5c99480de_theyre%20eating%20the%20cats%20hello%20-%20Pinky%20toe.png",
			  "alt": null
			}
		 }
	  },
	  {
		 "id": "672416e5ebfed8d238a31c52",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-03T17:00:02.589Z",
		 "lastUpdated": "2024-11-03T17:00:02.589Z",
		 "createdOn": "2024-10-31T23:46:45.482Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">Once upon a time in the twilight dusk, a kind, beautiful, sexy, gorgina, girl, named Cindierella, not unlike myself one could say, had 2 evil study group members in her intro coding class. Every day during DS100 they would laugh and say “hahaha you dont know how to code you little dumdum you”. And they were right, there had never been a person in the history of the FTU (FairyTale Universe of course) that was more booty cheeks ass at coding. But the prophecy bestowed by her google calendar decreed that her quest would not only include going to class, but also, heaven forbid, taking notes. Alas she was the chosen one and must therefore obey O Gcal’s call to adventure every tuesday and thursday.</p><p id=\"\">‍</p><p id=\"\">Every night when Cindie would do her homework, she would sing a trending tiktok sound out the window and the rats and squirrels of comm ave would scritter into her room and they would sing and dance and do her coding homework for her! Her roomates hated her, the rats would shit all over the room and the squirrels would steal any edikted top they could find buried in the drawers. But never princess polly, they were particular about that.&nbsp;</p><p id=\"\">‍</p><p id=\"\">One fateful tuesday the upcoming midterm was announced and Cindierella cried and cried because how was she going to sneak a rat into questrom! Ugh and a squirrel would be even worse, she’d have to tell everyone she got hair extensions, or perhaps that minx scarves are back in this year? When all of a sudden in a puff of smoke Fairy GodTerrier appeared in the dorm! But dont get the wrong idea, not like a real dog enlarged, instead stood a very tall man in the rhett costume, topped with a fluffy dress, cape, and a comically large magic wand embellished with a bedazzled star.</p><p id=\"\">“Cindierella I have come to grant a brief switcheroo of The Zuck’s coding abilities and your ability to knit really fucking fast. From now until 6pm you will be a python whiz and Zuck will spend some quality time making his family some meaningful christmas gifts.”&nbsp;</p><p id=\"\">‍</p><p id=\"\">Cinderella hip hip hoorayed and headed to the computer to test it out, and before she even knew what her hands were doing she had typed:</p><p id=\"\">‍</p><p id=\"\">“result = {\"original_list\": input_list, \"filtered_sum\": sum(map(lambda x: x if x &lt;= threshold else 0, filter(lambda y: y &lt;= threshold, map(lambda n: (lambda f, m: f(f, m))(lambda f, m: m if m &lt;= 1 else m * f(f, m-1), n), input_list))))}”</p><p id=\"\">‍</p><p id=\"\">She had no idea what that did but the cell ran perfectly so she hip hip hoorayed yet again. God her roomates hated her.</p><p id=\"\">‍</p><p id=\"\">Cindie wore her best indie outfit on the day of the royal midterm, ready to dress to impress her evil study group partners and dared ascend the steps of questrom for her 4:45 data science lecture. As she stepped up each stair she began to notice a sinister, evil sound… flip, flop, flip, flop. She looked down at her shoe, better known on depop as vintage thrifted y2k office-siren painted leather doc marten loafers, and realized the sole was slowly peeling off and flapping and clapping in the wind with each step. Cindie rushed inside and prayed and prayed it wouldnt fall off in front of the dwarves smoking their hooked pipes outside the questrom doors, lest they trap her in a riddle. Cindie began the midterm but even with her new magical talents it was slow going typing all this shit out. Before she knew it, it was 6pm and she hadnt finished so she wiped her hands on the keyboard and hoped that some successful code was buried in that keyboard smash and ran out of the lecture hall before anyone noticed she was a cheating coding genius.&nbsp;</p><p id=\"\">‍</p><p id=\"\">Yet on the way down, the unthinkable happened. The sole of her docs fell off right in front of a girl in a designer suit and before she could hurl her goyard bag at Cindie for being a poor, stupid, poor person, Cindie ran down the steps leaving the poor old sole behind.&nbsp;</p><p id=\"\">‍</p><p id=\"\">Back safely at home she hoped that one day a beautiful and rich questrom girl in the process of discovering her queer identity would find her sole, subsequently find Cindie and of course share true love’s first kiss in front of the security guard. But alas, here I am still waiting for my Princess Charming…</p><p id=\"\">‍</p><p id=\"\">‍</p>",
			"postsummary": "A modern retelling of a classic love tale. ",
			"name": "My Cindierella Story: sole of my thrifted docs fell off on the questrom stairs",
			"slug": "my-cindierella-story-sole-of-my-thrifted-docs-fell-off-on-the-questrom-stairs",
			"website-image": {
			  "fileId": "672416783f3a402e2d813e10",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/672416783f3a402e2d813e10_My%20Cindierella%20Story.jpg",
			  "alt": null
			},
			"author": "65c1015340da098b1e6235f3"
		 }
	  },
	  {
		 "id": "6724160416d26c58583fb8a6",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-03T16:47:55.352Z",
		 "lastUpdated": "2024-11-02T16:00:02.097Z",
		 "createdOn": "2024-10-31T23:43:00.733Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">The trend of adorning cakes with printed out images of characters and people alike has gone viral. People are sharing their ideas of what their “hear-me-outs” are to see who else shares in their particular fantasy (don’t lie, we’ve all thought about how hot Spirit the Horse was at least one in out life). To honor that, I’d like to give my version of my top 10 strangest cake toppers in an increasing order of atrociousness.</p><ol id=\"\"><li id=\"\">Gill from Finding Nemo: There is no explanation needed for this one. He’s almost not even a hear-me-out. If you look up “sexy fish from nemo,” he comes out!</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/67241414510a4d47545a2607_AD_4nXfoLN1gxrwcpeG2zHhMlIIrA3tLeD04knEYF3VE0SAtb9W9_mZ7q4dPIq_BqI0KssZbm3ZxaRH88ZjfTmPQ-eh9EZ3E57Hieaw8bApYNaxnhZPro9KcQCreo6FORzwUakTZsTX2RD9HUSycHakH5xR7GF0.jpeg\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"2\" id=\"\"><li id=\"\">Easter Bunny from Rise of the Guardian: He kinda had chemistry with Jack Frost in the movie, so I feel like we’d have a whole bi4bi thing going on.&nbsp;</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/67241414e934d0868d40c52d_AD_4nXeQ1CsiqZsdVTgC6JSMM4ydPkK-dZ4i26L6grE15cnwVyFRKrYMqfe1YbgNhVjNgG6bdrRKFVLbmCmxALxyROp1oCNDoFA5oel6EoYcglMjC5rwZopaxl9VdtE09IuWUxaVXixgUIF0Tur-Y43BPBzYIvlr.png\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"3\" id=\"\"><li id=\"\">Progressive Box from the Progressive commercials: I’m a sucker for funny guys, but I fear he would use me for stand up material and dump me like all the other insurance boxes I’ve dated.</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/67241414fec3b51390ff9f7c_AD_4nXdabIcYcAeW1inlBkzeoUFnnsJcDr-WSa2mvJaCVUOJpK4D2xyY-KD46rbbLE469vARhqXxLFQCLHmz9bFd07PAEdCzkp9ci1XctZ9YnnBKX-wTPtiq9ayuPqjBMGV1BLMRhdtawFLVh2iehmevz6N2q7TV.jpeg\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"4\" id=\"\"><li id=\"\">Colgate 360º Toothbrush: He just… commands the space. This angle especially had me feeling some type of way (I wish to be that pink brush so badly).</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/672414149dc4c6dc4b9ba999_AD_4nXeOAgg73Apc6N0QigUXAdkHUIG1forrfrXI4tiWSYyB8XaPXxsniog1iY2zipl2NkL9OGVndRNlt06PN3o-iYr4r5ikTI6pZ4qJWv1rD7hdnU7_SWNwpkkZZmRLhCtANUbQWABn0UvywPm2KvSXSHw9t5k.jpeg\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"5\" id=\"\"><li id=\"\">Closet from Barbie life in the Dreamhouse: He’d help me stay stylish while also using that hand to fulfill my needs.</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/67241415ebfed8d238a109e4_AD_4nXcnBDlMSXj1Eta-g_25PI-jpmovpdNK7yYMKoWaBAe6T2SriDpqEy7b5RM9EJAn9L889kPIk6T5O4fr-JYH-0spuCdRJGGF__qAoBVcyvxjkaKXqRgrPsBiSEcNhqW5HyrhrPAO3hsy1vS0y0sbWiToRmmt.png\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"6\" id=\"\"><li id=\"\">Jack in the Box: His whole vibe screams sugar daddy. He’s rich <em id=\"\">and</em> his food is great pre-, during, and post-drunk food. What more can a girl ask for? And those arms are yum!</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/672414149dc4c6dc4b9ba991_AD_4nXfgyovA6pOUT5SG-VNBkFBflFXvfwYxI3IqiT4nhg6CK_Ct91n698o08xTtooacOereQZy4nAi1yKusKP1rJzOauWMau3jla6MDcynwYf-FUH946MiId0Y5n_yyMPXGXvrQiYC9BVQ293v05GlqFO_PjR0.jpeg\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"7\" id=\"\"><li id=\"\">Nick Wilde, but specifically from the Zootopia abortion comic: I’ll just leave this here.</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/6724141477bc6d78c3f99b19_AD_4nXfam9HSla_LjkahUv7GDkrvjCSw6zG1IDOgRuBeAKyLlOIBSUWsHLpYD4HDYiXhskcA4nA5xuI8epMd84xVdvAo-RJe6VZf8Ea47XOoUNcQD8Pdaq36zpPHu2MXl5dmEklFSI-n7BPZEUYLRtk8eoZNxVxX.jpeg\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"8\" id=\"\"><li id=\"\">My roommate’s sequin Steve Buscemi pillow: Again, I’ll just leave this one to marinate here.</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/67241414a0ab110383eb6ee2_AD_4nXcafOGAg4LwkEO9HRKEMiKelSKV-RpjLgkj-chk5SJ3N_YMPZWpecfzaq_pWz45nYewUTUdYlVcWjbo5S2qnB6dGZW7yGXJ_HlG1pzkSE1VV_eNLGeH7enWBJv-n6bRaHNsc5sVz4r5nrgLJ932_4-j9zvd.jpeg\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><ol start=\"9\" id=\"\"><li id=\"\">The math equation 7x3=21: Something about it just feels <em id=\"\">right</em>. Like, the equation would know how to treat me like the boss bitch I am without feeling threatened by my success.</li></ol><p id=\"\">7 x 3 = 21</p><ol start=\"10\" id=\"\"><li id=\"\">Pedro Pascal: I know no one else in the world agrees with this one, so I suppose he’s my own person hear-me-out.</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/67241414f94222ef02bf5360_AD_4nXdsyKLUO1Z3cr7-frPUpSICtMnZEc__gLx9NZy3f62VoskfzWFzuE87NLJJdFBm4JEClF8EqHd98QbTpVEVqMpO3_CdpbYK9l-YIG-1TF142Fc0j4xwqIaLAk_unRyo1wYNjLeUrYnWwAgB4b7R9LbVRVC1.jpeg\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\" id=\"\"></div></figure><p id=\"\">‍</p>",
			"postsummary": "The trend of adorning cakes with printed out images of characters and people alike has gone viral. People are sharing their ideas of what their “hear-me-outs” are to see who else shares in their particular fantasy (don’t lie, we’ve all thought about how hot Spirit the Horse was at least one in out life). ",
			"name": "My Foul, Atrocious, \"Hear-Me-Out\" Cake Toppers ",
			"slug": "my-foul-atrocious-hear-me-out-cake-toppers",
			"website-image": {
			  "fileId": "67241469e1627ef2f2eabe75",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/67241469e1627ef2f2eabe75_hear%20me%20out%20cake_%20WEB.jpg",
			  "alt": null
			},
			"author": "65c100c234bf72ebad0893d2"
		 }
	  },
	  {
		 "id": "6724123edd1b59253fdab9ab",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-03T16:47:55.352Z",
		 "lastUpdated": "2024-11-01T16:00:02.013Z",
		 "createdOn": "2024-10-31T23:26:54.900Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": false,
			"article-text": "<p id=\"\">No, like seriously…&nbsp;</p><p>‍</p><p id=\"\">So basically, the show takes place in a world where the Earth exists in the same universe as a race of magical aliens with gems at the center of their bodies which are just manifestations of light. The gem race comes from a place called Homeworld, and they’re led by the Diamond Authority which consists of three tall ass cunty bad bitches (one of them is literally voiced by Patti Lupone) and one little runt named Pink Diamond. Now the Diamonds use the resources on their planet to create more gems to be their followers and fulfill specific duties and they go around colonizing other planets to use their resources to make more gems. The story arch of the show itself begins when the Diamonds try to conquer Earth.</p><p>‍</p><p id=\"\">\tPink Diamond was like the baby of the Diamonds and didn’t have any colonies that she was in charge of so like the whiny bitch she was, she literally begged to have her own colony. The other three Diamonds gave her Earth, but she literally got bored right away cause it wasn’t as interesting as she thought it was gonna be.</p><p id=\"\">\t</p><p id=\"\">\tDuring the time that she was commanding the colony, one of her Rose Quartz soldiers goes rogue because she just loves all of the organic life forms on Earth and starts a rebellion to try and win Earth’s freedom. She rallies a bunch of rebel gems together calling themselves the Crystal Gems and they fight for like a couple thousand years and eventually Rose Quartz SHATTERS Pink Diamond (which basically is like the only way to kill these immortal beings). The rebellion ends up winning the war, but the other three Diamonds get really mad cause their sister/kid (idk) Pink Diamond is dead and unleash the ultimate attack on earth which takes out literally every gem on earth except Rose Quartz and the three other gems she can hide behind her shield.</p><p>‍</p><p id=\"\">\tRose Quartz and her besties, Garnet, Amethyst, and Pearl all live on Earth for another couple of thousand years and eventually Rose falls in love with this human named Greg Universe. Props to Greg for bagging an 8ft tall pink haired curvy alien diva. Rose then decides that she wants to like have a kid with Greg even though that's unheard of and makes our main character, the half gem half human Steven Universe (roll credits, jk, I’m nowhere near done) and as a result gives up her physical form. RIP.</p><p>‍</p><p id=\"\">\tSo the show starts following Steven who’s kind of in uncharted territory because he’s the first ever gem human hybrid. We follow along on his journey as he learns to control the powers that he inherited from his mother, like her shield and healing powers. On his journey he is mentored by the remaining three Crystal Gems Garnet, Amethyst, and Pearl who all love him but are also kinda sad that baddie b Rose Quartz is gone. Steven meets a pink lion that was somehow connected to his mom which also has a whole dimension in his mane where Rose Quartz kept secrets. The Diamonds are also still pissed at Rose Quartz so the Crystal Gems have to thwart a few plans to destroy the Earth and make some new friends along the way. Then in search of answers, Steven goes to the place where his mom shattered Pink Diamond and what do you know, Blue Diamond is there and abducts his dad. The Crystal Gems have to go into space to save Greg and this really pisses off the Diamonds and then they send two gems to abduct a bunch of humans that Steven mentioned in a previous episode. Steven being the selfless main character he is, turns himself in for his friends’ freedom. Also one of his human friends, Lars,&nbsp; hid on the abduction ship and still got captured like a loser.</p><p>‍</p><p id=\"\">\tSteven gets taken to space and put on trial as Rose Quartz for killing Pink Diamond and his lawyer is like “yo this doesn’t make sense, how could Rose Quartz have even killed Pink Diamond? Why wasn’t anyone protecting her” and Steven is all like “Wait a minute, he’s got a point.” But this just makes the Diamonds angry so Steven takes Lars and manages to escape into the deep caves of Homeworld. They meet some other rebel gems who the Diamonds want dead and Lars dies protecting them, but Steven brings him back to life with his tears and Lars turns purple and gets magic hair that connects to the same dimension as lion’s mane and Steven uses it to go home. Then they lowkey act like everything is normal as if Steven wasn’t just abducted into the far recesses of space. Steven learns from Pearl, Rose’s sworn secret keeper and attendant that ROSE QUARTZ WAS ACTUALLY PINK DIAMOND AND FAKED HER OWN DEATH. Crazy right? I know.</p><p>‍</p><p id=\"\">\tAfter this, Yellow and Blue Diamond come to Earth to fuck shit up but Steven is like, “Wait, I’m literally Pink Diamond.” And Yellow and Blue are like “Slay, you’re not dead” and they all go back to Homeworld together.</p><p>‍</p><p id=\"\">\tThen there’s kinda drama because the Diamonds aren't actually fully happy with Steven being Pink Diamond so they throw him in jail for a bit and all of them beef. The White Diamond pulls Steven’s gem out of his stomach cause she wants the regular Pink Diamond back but it doesn’t work and the gem just turns into a Pink Steven that refuses with him. Then they decide to love him like he’s the real Pink Diamond and then happily ever after.</p><p>‍</p><p id=\"\">\tThere’s like a whole movie and another sequel show after that but I’ll spare you the details of that. Anyway…what were we doing?</p><p>‍</p>",
			"postsummary": "Sit down and listen to me explain the most interconnected and beautiful story know to humanity. ",
			"name": "I Lied, Put Your Clothes Back On. We're Actually Gonna Talk About the Entire Steven Universe Lore",
			"slug": "i-lied-put-your-clothes-back-on-were-actually-gonna-talk-about-the-entire-steven-universe-lore",
			"website-image": {
			  "fileId": "67241222f94222ef02be0317",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/67241222f94222ef02be0317_steven%20universe%20lore%20website.jpg",
			  "alt": null
			},
			"author": "65c10073b4031ca2ece60a9f"
		 }
	  },
	  {
		 "id": "6723b7061e59e2eb198cf6f7",
		 "cmsLocaleId": "659444782072da89d2270aa8",
		 "lastPublished": "2024-11-03T16:47:55.352Z",
		 "lastUpdated": "2024-10-31T17:13:52.908Z",
		 "createdOn": "2024-10-31T16:57:42.598Z",
		 "isArchived": false,
		 "isDraft": false,
		 "fieldData": {
			"featured": true,
			"article-text": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://cdn.prod.website-files.com/659444782072da89d2270aab/6723b7061e59e2eb198cf6a4_6723b6b2831b736155853262_Screenshot%25202024-10-31%2520at%252012.56.09%25E2%2580%25AFPM.png\" loading=\"lazy\" alt=\"__wf_reserved_inherit\"></div></figure><p>‍</p><p>Yup, that’s me. The really hot girl with the digicam. But what if I told you that I was writing this from… <em id=\"\">inside</em> the digicam…</p><p id=\"\">As if senior year couldn’t get any worse, my life has decided to play out like I’m in an early 2000s DCOM and I have some essential coming-of-age life lesson that I need to learn. But instead of giving me a long-lost twin or finding my soulmate under some wacky circumstances, they stuck me in a camera.</p><p>‍</p><p id=\"\">And not even a high-quality one either. It’s my dingy Canon PowerShot that I got in 2013. Honestly, I’m not even meant to be here. Sure I would shove it in everyone’s faces, blind people with the flash, and take a little too long to upload and distribute the photos, but does that make me worthy of this punishment?</p><p>‍</p><p id=\"\">It really isn’t all fun and games either. Now I’m always on picture duty, I’m continuously reminded that my eyebrows are too curly, and the outfit I was in when I got stuck is impractical (It’s ice cold in there!). Who knew… a piece of technology has no warmth on the inside…</p><p>‍</p><p id=\"\">Anyway, as I’ve been stuck in here for more than a month, I’ve decided to try and turn this wretched curse off and help out those who try and take photos using the camera in which I inhabit. I use the magical rays that shoot out of it to help them pose, make decisions about which friends are going to be in it, and make sure that both the horizontal and vertical photos look equally as good. But by golly, nothing seems to work! Why isn’t my plan of deliberately being nice, but not kind, to others for no apparent reason other than what I may gain from it working?</p><p>‍</p><p id=\"\">Probably because of this: First of all, you uglies are ruining the classic photos that my poor PowerShot took. Second, I made a Dorian Gray-inspired deal with the geriatric owner of a camera shop in which I sold my soul to ensure that my youth and beauty would be secure while all the photographic versions of me on the camera would grow old and fade instead. But as it turns out, I had actually broken one of the cameras he owned on a drunken night out months prior so this was really just his way of cursing me as revenge. Which is like… ok… but look at all of the cunty photographs I have of myself now!</p><p>‍</p>",
			"name": "Help! My Soul is Trapped in an Early 2010s Digital Camera ",
			"slug": "help-my-soul-is-trapped-in-an-early-2010s-digital-camera",
			"postsummary": "Im a hot girl in a digicam, you gotta click me the right way ",
			"website-image": {
			  "fileId": "6723b6f8ce073ffaedaeb971",
			  "url": "https://cdn.prod.website-files.com/659444782072da89d2270aab/6723b6f8ce073ffaedaeb971_Help!%20My%20Soul%20is%20Trapped%20in%20an%20Early%202010s%20Digital%20Camera%20.png",
			  "alt": null
			},
			"author": "65c0ffe2341185f44c76f1ff"
		 }
	  }
	],
	"pagination": {
	  "limit": 20,
	  "offset": 0,
	  "total": 74
	}
 }
